; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_8)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 link9 link10 link11 link12 - link
    angle0 angle30 angle60 angle90 angle120 angle150 angle180 angle210 angle240 angle270 angle300 angle330 - angle)
(:init
    (AngleOrd angle0 angle30)
    (AngleOrd angle30 angle60)
    (AngleOrd angle60 angle90)
    (AngleOrd angle90 angle120)
    (AngleOrd angle120 angle150)
    (AngleOrd angle150 angle180)
    (AngleOrd angle180 angle210)
    (AngleOrd angle210 angle240)
    (AngleOrd angle240 angle270)
    (AngleOrd angle270 angle300)
    (AngleOrd angle300 angle330)
    (AngleOrd angle330 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)
    (IsChildOf link9 link8)
    (IsChildOf link10 link9)
    (IsChildOf link11 link10)
    (IsChildOf link12 link11)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)
    (Affected link8 link1)
    (Affected link8 link2)
    (Affected link8 link3)
    (Affected link8 link4)
    (Affected link8 link5)
    (Affected link8 link6)
    (Affected link8 link7)
    (Affected link9 link1)
    (Affected link9 link2)
    (Affected link9 link3)
    (Affected link9 link4)
    (Affected link9 link5)
    (Affected link9 link6)
    (Affected link9 link7)
    (Affected link9 link8)
    (Affected link10 link1)
    (Affected link10 link2)
    (Affected link10 link3)
    (Affected link10 link4)
    (Affected link10 link5)
    (Affected link10 link6)
    (Affected link10 link7)
    (Affected link10 link8)
    (Affected link10 link9)
    (Affected link11 link1)
    (Affected link11 link2)
    (Affected link11 link3)
    (Affected link11 link4)
    (Affected link11 link5)
    (Affected link11 link6)
    (Affected link11 link7)
    (Affected link11 link8)
    (Affected link11 link9)
    (Affected link11 link10)
    (Affected link12 link1)
    (Affected link12 link2)
    (Affected link12 link3)
    (Affected link12 link4)
    (Affected link12 link5)
    (Affected link12 link6)
    (Affected link12 link7)
    (Affected link12 link8)
    (Affected link12 link9)
    (Affected link12 link10)
    (Affected link12 link11)

    (HasAngle angle0 link1)
    (HasAngle angle210 link2)
    (HasAngle angle180 link3)
    (HasAngle angle60 link4)
    (HasAngle angle120 link5)
    (HasAngle angle90 link6)
    (HasAngle angle30 link7)
    (HasAngle angle330 link8)
    (HasAngle angle180 link9)
    (HasAngle angle240 link10)
    (HasAngle angle90 link11)
    (HasAngle angle150 link12)
)
(:goal
(and
    (HasAngle angle210 link1)
    (HasAngle angle210 link2)
    (HasAngle angle240 link3)
    (HasAngle angle60 link4)
    (HasAngle angle150 link5)
    (HasAngle angle60 link6)
    (HasAngle angle150 link7)
    (HasAngle angle90 link8)
    (HasAngle angle270 link9)
    (HasAngle angle330 link10)
    (HasAngle angle0 link11)
    (HasAngle angle330 link12)
    )
)
)

; plan
1. (decrease_angle link1 angle0 angle330)
   deleted: (hasangle angle0 link1) (hasangle angle210 link2) (hasangle angle180 link3) (hasangle angle60 link4) (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle30 link7) (hasangle angle330 link8) (hasangle angle180 link9) (hasangle angle240 link10) (hasangle angle90 link11) (hasangle angle150 link12)
   added: (hasangle angle330 link1) (hasangle angle180 link2) (hasangle angle150 link3) (hasangle angle30 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle0 link7) (hasangle angle300 link8) (hasangle angle150 link9) (hasangle angle210 link10) (hasangle angle60 link11) (hasangle angle120 link12)
   goals met: 1 of 12
2. (decrease_angle link1 angle330 angle300)
   deleted: (hasangle angle330 link1) (hasangle angle180 link2) (hasangle angle150 link3) (hasangle angle30 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle0 link7) (hasangle angle300 link8) (hasangle angle150 link9) (hasangle angle210 link10) (hasangle angle60 link11) (hasangle angle120 link12)
   added: (hasangle angle300 link1) (hasangle angle150 link2) (hasangle angle120 link3) (hasangle angle0 link4) (hasangle angle60 link5) (hasangle angle30 link6) (hasangle angle330 link7) (hasangle angle270 link8) (hasangle angle120 link9) (hasangle angle180 link10) (hasangle angle30 link11) (hasangle angle90 link12)
   goals met: 0 of 12
3. (decrease_angle link1 angle300 angle270)
   deleted: (hasangle angle300 link1) (hasangle angle150 link2) (hasangle angle120 link3) (hasangle angle0 link4) (hasangle angle60 link5) (hasangle angle30 link6) (hasangle angle330 link7) (hasangle angle270 link8) (hasangle angle120 link9) (hasangle angle180 link10) (hasangle angle30 link11) (hasangle angle90 link12)
   added: (hasangle angle270 link1) (hasangle angle120 link2) (hasangle angle90 link3) (hasangle angle330 link4) (hasangle angle30 link5) (hasangle angle0 link6) (hasangle angle300 link7) (hasangle angle240 link8) (hasangle angle90 link9) (hasangle angle150 link10) (hasangle angle0 link11) (hasangle angle60 link12)
   goals met: 1 of 12
4. (decrease_angle link1 angle270 angle240)
   deleted: (hasangle angle270 link1) (hasangle angle120 link2) (hasangle angle90 link3) (hasangle angle330 link4) (hasangle angle30 link5) (hasangle angle0 link6) (hasangle angle300 link7) (hasangle angle240 link8) (hasangle angle90 link9) (hasangle angle150 link10) (hasangle angle0 link11) (hasangle angle60 link12)
   added: (hasangle angle240 link1) (hasangle angle90 link2) (hasangle angle60 link3) (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle330 link6) (hasangle angle270 link7) (hasangle angle210 link8) (hasangle angle60 link9) (hasangle angle120 link10) (hasangle angle330 link11) (hasangle angle30 link12)
   goals met: 0 of 12
5. (decrease_angle link1 angle240 angle210)
   deleted: (hasangle angle240 link1) (hasangle angle90 link2) (hasangle angle60 link3) (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle330 link6) (hasangle angle270 link7) (hasangle angle210 link8) (hasangle angle60 link9) (hasangle angle120 link10) (hasangle angle330 link11) (hasangle angle30 link12)
   added: (hasangle angle210 link1) (hasangle angle60 link2) (hasangle angle30 link3) (hasangle angle270 link4) (hasangle angle330 link5) (hasangle angle300 link6) (hasangle angle240 link7) (hasangle angle180 link8) (hasangle angle30 link9) (hasangle angle90 link10) (hasangle angle300 link11) (hasangle angle0 link12)
   goals met: 1 of 12
6. (decrease_angle link2 angle60 angle30)
   deleted: (hasangle angle60 link2) (hasangle angle30 link3) (hasangle angle270 link4) (hasangle angle330 link5) (hasangle angle300 link6) (hasangle angle240 link7) (hasangle angle180 link8) (hasangle angle30 link9) (hasangle angle90 link10) (hasangle angle300 link11) (hasangle angle0 link12)
   added: (hasangle angle30 link2) (hasangle angle0 link3) (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle270 link6) (hasangle angle210 link7) (hasangle angle150 link8) (hasangle angle0 link9) (hasangle angle60 link10) (hasangle angle270 link11) (hasangle angle330 link12)
   goals met: 2 of 12
7. (decrease_angle link1 angle210 angle180)
   deleted: (hasangle angle210 link1) (hasangle angle30 link2) (hasangle angle0 link3) (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle270 link6) (hasangle angle210 link7) (hasangle angle150 link8) (hasangle angle0 link9) (hasangle angle60 link10) (hasangle angle270 link11) (hasangle angle330 link12)
   added: (hasangle angle180 link1) (hasangle angle0 link2) (hasangle angle330 link3) (hasangle angle210 link4) (hasangle angle270 link5) (hasangle angle240 link6) (hasangle angle180 link7) (hasangle angle120 link8) (hasangle angle330 link9) (hasangle angle30 link10) (hasangle angle240 link11) (hasangle angle300 link12)
   goals met: 0 of 12
8. (decrease_angle link1 angle180 angle150)
   deleted: (hasangle angle180 link1) (hasangle angle0 link2) (hasangle angle330 link3) (hasangle angle210 link4) (hasangle angle270 link5) (hasangle angle240 link6) (hasangle angle180 link7) (hasangle angle120 link8) (hasangle angle330 link9) (hasangle angle30 link10) (hasangle angle240 link11) (hasangle angle300 link12)
   added: (hasangle angle150 link1) (hasangle angle330 link2) (hasangle angle300 link3) (hasangle angle180 link4) (hasangle angle240 link5) (hasangle angle210 link6) (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle300 link9) (hasangle angle0 link10) (hasangle angle210 link11) (hasangle angle270 link12)
   goals met: 2 of 12
9. (increase_angle link11 angle210 angle240)
   deleted: (hasangle angle210 link11) (hasangle angle270 link12)
   added: (hasangle angle240 link11) (hasangle angle300 link12)
   goals met: 2 of 12
10. (increase_angle link11 angle240 angle270)
   deleted: (hasangle angle240 link11) (hasangle angle300 link12)
   added: (hasangle angle270 link11) (hasangle angle330 link12)
   goals met: 3 of 12
11. (decrease_angle link6 angle210 angle180)
   deleted: (hasangle angle210 link6) (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle300 link9) (hasangle angle0 link10) (hasangle angle270 link11) (hasangle angle330 link12)
   added: (hasangle angle180 link6) (hasangle angle120 link7) (hasangle angle60 link8) (hasangle angle270 link9) (hasangle angle330 link10) (hasangle angle240 link11) (hasangle angle300 link12)
   goals met: 2 of 12
12. (increase_angle link11 angle240 angle270)
   deleted: (hasangle angle240 link11) (hasangle angle300 link12)
   added: (hasangle angle270 link11) (hasangle angle330 link12)
   goals met: 3 of 12
13. (increase_angle link11 angle270 angle300)
   deleted: (hasangle angle270 link11) (hasangle angle330 link12)
   added: (hasangle angle300 link11) (hasangle angle0 link12)
   goals met: 2 of 12
14. (decrease_angle link12 angle0 angle330)
   deleted: (hasangle angle0 link12)
   added: (hasangle angle330 link12)
   goals met: 3 of 12
15. (decrease_angle link12 angle330 angle300)
   deleted: (hasangle angle330 link12)
   added: (hasangle angle300 link12)
   goals met: 2 of 12
16. (increase_angle link11 angle300 angle330)
   deleted: (hasangle angle300 link11) (hasangle angle300 link12)
   added: (hasangle angle330 link11) (hasangle angle330 link12)
   goals met: 3 of 12
17. (decrease_angle link12 angle330 angle300)
   deleted: (hasangle angle330 link12)
   added: (hasangle angle300 link12)
   goals met: 2 of 12
18. (increase_angle link7 angle120 angle150)
   deleted: (hasangle angle120 link7) (hasangle angle60 link8) (hasangle angle270 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle300 link12)
   added: (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle300 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle330 link12)
   goals met: 4 of 12
19. (decrease_angle link9 angle300 angle270)
   deleted: (hasangle angle300 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle330 link12)
   added: (hasangle angle270 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle300 link12)
   goals met: 4 of 12
20. (increase_angle link7 angle150 angle180)
   deleted: (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle300 link12)
   added: (hasangle angle180 link7) (hasangle angle120 link8) (hasangle angle300 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle330 link12)
   goals met: 2 of 12
21. (decrease_angle link8 angle120 angle90)
   deleted: (hasangle angle120 link8) (hasangle angle300 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle330 link12)
   added: (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle300 link12)
   goals met: 3 of 12
22. (increase_angle link3 angle300 angle330)
   deleted: (hasangle angle300 link3) (hasangle angle180 link4) (hasangle angle240 link5) (hasangle angle180 link6) (hasangle angle180 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle300 link12)
   added: (hasangle angle330 link3) (hasangle angle210 link4) (hasangle angle270 link5) (hasangle angle210 link6) (hasangle angle210 link7) (hasangle angle120 link8) (hasangle angle300 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle330 link12)
   goals met: 2 of 12
23. (decrease_angle link4 angle210 angle180)
   deleted: (hasangle angle210 link4) (hasangle angle270 link5) (hasangle angle210 link6) (hasangle angle210 link7) (hasangle angle120 link8) (hasangle angle300 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle330 link12)
   added: (hasangle angle180 link4) (hasangle angle240 link5) (hasangle angle180 link6) (hasangle angle180 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle300 link12)
   goals met: 3 of 12
24. (increase_angle link7 angle180 angle210)
   deleted: (hasangle angle180 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle300 link12)
   added: (hasangle angle210 link7) (hasangle angle120 link8) (hasangle angle300 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle330 link12)
   goals met: 2 of 12
25. (increase_angle link6 angle180 angle210)
   deleted: (hasangle angle180 link6) (hasangle angle210 link7) (hasangle angle120 link8) (hasangle angle300 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle330 link12)
   added: (hasangle angle210 link6) (hasangle angle240 link7) (hasangle angle150 link8) (hasangle angle330 link9) (hasangle angle30 link10) (hasangle angle30 link11) (hasangle angle0 link12)
   goals met: 0 of 12
26. (decrease_angle link2 angle330 angle300)
   deleted: (hasangle angle330 link2) (hasangle angle330 link3) (hasangle angle180 link4) (hasangle angle240 link5) (hasangle angle210 link6) (hasangle angle240 link7) (hasangle angle150 link8) (hasangle angle330 link9) (hasangle angle30 link10) (hasangle angle30 link11) (hasangle angle0 link12)
   added: (hasangle angle300 link2) (hasangle angle300 link3) (hasangle angle150 link4) (hasangle angle210 link5) (hasangle angle180 link6) (hasangle angle210 link7) (hasangle angle120 link8) (hasangle angle300 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle330 link12)
   goals met: 2 of 12
27. (decrease_angle link2 angle300 angle270)
   deleted: (hasangle angle300 link2) (hasangle angle300 link3) (hasangle angle150 link4) (hasangle angle210 link5) (hasangle angle180 link6) (hasangle angle210 link7) (hasangle angle120 link8) (hasangle angle300 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle330 link12)
   added: (hasangle angle270 link2) (hasangle angle270 link3) (hasangle angle120 link4) (hasangle angle180 link5) (hasangle angle150 link6) (hasangle angle180 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle300 link12)
   goals met: 3 of 12
28. (decrease_angle link2 angle270 angle240)
   deleted: (hasangle angle270 link2) (hasangle angle270 link3) (hasangle angle120 link4) (hasangle angle180 link5) (hasangle angle150 link6) (hasangle angle180 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle300 link12)
   added: (hasangle angle240 link2) (hasangle angle240 link3) (hasangle angle90 link4) (hasangle angle150 link5) (hasangle angle120 link6) (hasangle angle150 link7) (hasangle angle60 link8) (hasangle angle240 link9) (hasangle angle300 link10) (hasangle angle300 link11) (hasangle angle270 link12)
   goals met: 3 of 12
29. (increase_angle link10 angle300 angle330)
   deleted: (hasangle angle300 link10) (hasangle angle300 link11) (hasangle angle270 link12)
   added: (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle300 link12)
   goals met: 4 of 12
30. (increase_angle link12 angle300 angle330)
   deleted: (hasangle angle300 link12)
   added: (hasangle angle330 link12)
   goals met: 5 of 12
31. (increase_angle link8 angle60 angle90)
   deleted: (hasangle angle60 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle330 link12)
   added: (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle0 link12)
   goals met: 6 of 12
32. (decrease_angle link2 angle240 angle210)
   deleted: (hasangle angle240 link2) (hasangle angle240 link3) (hasangle angle90 link4) (hasangle angle150 link5) (hasangle angle120 link6) (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle0 link12)
   added: (hasangle angle210 link2) (hasangle angle210 link3) (hasangle angle60 link4) (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle120 link7) (hasangle angle60 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle330 link12)
   goals met: 4 of 12
33. (increase_angle link7 angle120 angle150)
   deleted: (hasangle angle120 link7) (hasangle angle60 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle330 link12)
   added: (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle0 link12)
   goals met: 6 of 12
34. (decrease_angle link4 angle60 angle30)
   deleted: (hasangle angle60 link4) (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle0 link12)
   added: (hasangle angle30 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle120 link7) (hasangle angle60 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle330 link12)
   goals met: 4 of 12
35. (increase_angle link1 angle150 angle180)
   deleted: (hasangle angle150 link1) (hasangle angle210 link2) (hasangle angle210 link3) (hasangle angle30 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle120 link7) (hasangle angle60 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle330 link12)
   added: (hasangle angle180 link1) (hasangle angle240 link2) (hasangle angle240 link3) (hasangle angle60 link4) (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle0 link12)
   goals met: 6 of 12
36. (decrease_angle link2 angle240 angle210)
   deleted: (hasangle angle240 link2) (hasangle angle240 link3) (hasangle angle60 link4) (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle0 link12)
   added: (hasangle angle210 link2) (hasangle angle210 link3) (hasangle angle30 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle120 link7) (hasangle angle60 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle330 link12)
   goals met: 4 of 12
37. (decrease_angle link12 angle330 angle300)
   deleted: (hasangle angle330 link12)
   added: (hasangle angle300 link12)
   goals met: 3 of 12
38. (decrease_angle link12 angle300 angle270)
   deleted: (hasangle angle300 link12)
   added: (hasangle angle270 link12)
   goals met: 3 of 12
39. (increase_angle link1 angle180 angle210)
   deleted: (hasangle angle180 link1) (hasangle angle210 link2) (hasangle angle210 link3) (hasangle angle30 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle120 link7) (hasangle angle60 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle270 link12)
   added: (hasangle angle210 link1) (hasangle angle240 link2) (hasangle angle240 link3) (hasangle angle60 link4) (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle300 link12)
   goals met: 7 of 12
40. (decrease_angle link2 angle240 angle210)
   deleted: (hasangle angle240 link2) (hasangle angle240 link3) (hasangle angle60 link4) (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle300 link12)
   added: (hasangle angle210 link2) (hasangle angle210 link3) (hasangle angle30 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle120 link7) (hasangle angle60 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle270 link12)
   goals met: 4 of 12
41. (increase_angle link3 angle210 angle240)
   deleted: (hasangle angle210 link3) (hasangle angle30 link4) (hasangle angle90 link5) (hasangle angle60 link6) (hasangle angle120 link7) (hasangle angle60 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle270 link12)
   added: (hasangle angle240 link3) (hasangle angle60 link4) (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle300 link12)
   goals met: 8 of 12
42. (increase_angle link5 angle120 angle150)
   deleted: (hasangle angle120 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle300 link12)
   added: (hasangle angle150 link5) (hasangle angle120 link6) (hasangle angle180 link7) (hasangle angle120 link8) (hasangle angle300 link9) (hasangle angle30 link10) (hasangle angle30 link11) (hasangle angle330 link12)
   goals met: 6 of 12
43. (decrease_angle link6 angle120 angle90)
   deleted: (hasangle angle120 link6) (hasangle angle180 link7) (hasangle angle120 link8) (hasangle angle300 link9) (hasangle angle30 link10) (hasangle angle30 link11) (hasangle angle330 link12)
   added: (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle300 link12)
   goals met: 9 of 12
44. (decrease_angle link6 angle90 angle60)
   deleted: (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle300 link12)
   added: (hasangle angle60 link6) (hasangle angle120 link7) (hasangle angle60 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle270 link12)
   goals met: 7 of 12
45. (increase_angle link7 angle120 angle150)
   deleted: (hasangle angle120 link7) (hasangle angle60 link8) (hasangle angle240 link9) (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle270 link12)
   added: (hasangle angle150 link7) (hasangle angle90 link8) (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle300 link12)
   goals met: 10 of 12
46. (increase_angle link12 angle300 angle330)
   deleted: (hasangle angle300 link12)
   added: (hasangle angle330 link12)
   goals met: 11 of 12
47. (increase_angle link12 angle330 angle0)
   deleted: (hasangle angle330 link12)
   added: (hasangle angle0 link12)
   goals met: 10 of 12
48. (decrease_angle link10 angle0 angle330)
   deleted: (hasangle angle0 link10) (hasangle angle0 link11) (hasangle angle0 link12)
   added: (hasangle angle330 link10) (hasangle angle330 link11) (hasangle angle330 link12)
   goals met: 11 of 12
49. (increase_angle link11 angle330 angle0)
   deleted: (hasangle angle330 link11) (hasangle angle330 link12)
   added: (hasangle angle0 link11) (hasangle angle0 link12)
   goals met: 11 of 12
50. (decrease_angle link12 angle0 angle330)
   deleted: (hasangle angle0 link12)
   added: (hasangle angle330 link12)
   goals met: 12 of 12
